app/views/posts/_form.html.erb

  <div class="field">
    <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %>
---
SELECT "tags".* FROM "tags"